<?php

return [
    //Плановое время запроса курса валют
    'TIME_REQUEST' => '13:05',
    //Интервалы между запросами в случае недоступности сервиса
    'ATTEMPT_INTERVAL' =>  [
        1 => 60,            //1 минута
        2 => 60 * 30,       //60 * 30 (30 мин)
        3 => 60 * 60,       //60 * 60 (1 час)
        4 => 60 * 60 * 6,   //60 * 60 * 6 (6 часов)
    ],
    //URL адрес сервиса для получения курсов валют
    'RATE_SOURCE' => 'http://www.cbr.ru/scripts/XML_daily.asp',
    'USD_ID' => 'R01235',
    'EUR_ID' => 'R01239',
];
